In [4]:
import sqlite3

conn = sqlite3.connect('chinook.db')
cur = conn.cursor()

strSQL = "SELECT *  FROM customers "
strSQL = strSQL + " where vip_rank = 2 "

print(strSQL)

cur.execute(strSQL)
results = cur.fetchall()
print(results)


# for row in results:
#     print(row)
    
conn.close()

SELECT *  FROM customers  where vip_rank = 2
[(1, 'Luís', 'Gonçalves', 'Embraer - Empresa Brasileira de Aeronáutica S.A.', 'Av. Brigadeiro Faria Lima, 2170', 'São José dos Campos', 'SP', 'Brazil', '12227-000', '+55 (12) 3923-5555', '+55 (12) 3923-5566', 'luisg@embraer.com.br', 3, 2), (3, 'François', 'Tremblay', None, '1498 rue Bélanger', 'Montréal', 'QC', 'Canada', 'H2G 1A7', '+1 (514) 721-4711', None, 'ftremblay@gmail.com', 3, 2), (4, 'Bjørn', 'Hansen', None, 'Ullevålsveien 14', 'Oslo', None, 'Norway', '0171', '+47 22 44 22 22', None, 'bjorn.hansen@yahoo.no', 4, 2), (5, 'František', 'Wichterlová', 'JetBrains s.r.o.', 'Klanova 9/506', 'Prague', None, 'Czech Republic', '14700', '+420 2 4172 5555', '+420 2 4172 5555', 'frantisekw@jetbrains.com', 4, 2), (7, 'Astrid', 'Gruber', None, 'Rotenturmstraße 4, 1010 Innere Stadt', 'Vienne', None, 'Austria', '1010', '+43 01 5134505', None, 'astrid.gruber@apple.at', 5, 2), (17, 'Jack', 'Smith', 'Microsoft Corporation', '1 Microsoft Way', 'Redmond', 'WA', 'USA', '98052-8300', '+1 (425) 882-8080', '+1 (425) 882-8081', 'jacksmith@microsoft.com', 5, 2), (20, 'Dan', 'Miller', None, '541 Del Medio Avenue', 'Mountain View', 'CA', 'USA', '94040-111', '+1 (650) 644-3358', None, 'dmiller@comcast.com', 4, 2), (22, 'Heather', 'Leacock', None, '120 S Orange Ave', 'Orlando', 'FL', 'USA', '32801', '+1 (407) 999-7788', None, 'hleacock@gmail.com', 4, 2), (24, 'Frank', 'Ralston', None, '162 E Superior Street', 'Chicago', 'IL', 'USA', '60611', '+1 (312) 332-3232', None, 'fralston@gmail.com', 3, 2), (25, 'Victor', 'Stevens', None, '319 N. Frances Street', 'Madison', 'WI', 'USA', '53703', '+1 (608) 257-0597', None, 'vstevens@yahoo.com', 5, 2), (28, 'Julia', 'Barnett', None, '302 S 700 E', 'Salt Lake City', 'UT', 'USA', '84102', '+1 (801) 531-7272', None, 'jubarnett@gmail.com', 5, 2), (34, 'João', 'Fernandes', None, 'Rua da Assunção 53', 'Lisbon', None, 'Portugal', None, '+351 (213) 466-111', None, 'jfernandes@yahoo.pt', 4, 2), (37, 'Fynn', 'Zimmermann', None, 'Berger Straße 10', 'Frankfurt', None, 'Germany', '60316', '+49 069 40598889', None, 'fzimmermann@yahoo.de', 3, 2), (42, 'Wyatt', 'Girard', None, '9, Place Louis Barthou', 'Bordeaux', None, 'France', '33000', '+33 05 56 96 96 96', None, 'wyatt.girard@yahoo.fr', 3, 2), (43, 'Isabelle', 'Mercier', None, '68, Rue Jouvence', 'Dijon', None, 'France', '21000', '+33 03 80 73 66 99', None, 'isabelle_mercier@apple.fr', 3, 2), (44, 'Terhi', 'Hämäläinen', None, 'Porthaninkatu 9', 'Helsinki', None, 'Finland', '00530', '+358 09 870 2000', None, 'terhi.hamalainen@apple.fi', 3, 2), (48, 'Johannes', 'Van der Berg', None, 'Lijnbaansgracht 120bg', 'Amsterdam', 'VV', 'Netherlands', '1016', '+31 020 6223130', None, 'johavanderberg@yahoo.nl', 5, 2)]

SELECT CustomerId
FROM 	(SELECT  CustomerId, sum(Total) as GrandTotal FROM invoices GROUP BY CustomerId  )
WHERE GrandTotal  < ( SELECT avg(GrandTotal)*0.5+max(GrandTotal)*0.5 as top25 
                                                 FROM (SELECT  CustomerId, sum(Total) as GrandTotal FROM invoices GROUP BY CustomerId) )
	  AND GrandTotal  >= ( SELECT avg(GrandTotal)  
      FROM (SELECT  CustomerId, sum(Total) as GrandTotal FROM invoices GROUP BY CustomerId))

In [22]:
import sqlite3

conn = sqlite3.connect('chinook.db')
cur = conn.cursor()


strSQL = " SELECT CustomerId  "
strSQL = strSQL + " FROM 	(SELECT  CustomerId, sum(Total) as GrandTotal FROM invoices GROUP BY CustomerId  ) "
strSQL = strSQL + " WHERE GrandTotal  > ( SELECT avg(GrandTotal)*0.5+max(GrandTotal)*0.5   "
strSQL = strSQL + " FROM (SELECT  CustomerId, sum(Total) as GrandTotal FROM invoices GROUP BY CustomerId) )  "

print(strSQL)

cur.execute(strSQL)
results = cur.fetchall()
print(results)


    
conn.close()

 SELECT CustomerId   FROM 	(SELECT  CustomerId, sum(Total) as GrandTotal FROM invoices GROUP BY CustomerId  )  WHERE GrandTotal  > ( SELECT avg(GrandTotal)*0.5+max(GrandTotal)*0.5    FROM (SELECT  CustomerId, sum(Total) as GrandTotal FROM invoices GROUP BY CustomerId) )
[(6,), (26,), (45,), (46,), (57,)]

In [25]:
print(results[0][0])

6

- Update 할때 for문으로 간단하게 sql 작성하기

In [35]:

for i in range(len(results)):
    CustId = results[i][0]
#     print(CustId)
    conn = sqlite3.connect('chinook.db')
    cur = conn.cursor()
    
    strSQL = " Update customers set vip_rank= 10 "
    strSQL = strSQL + " where customerid =  " + str(CustId) 
    
    cur.execute(strSQL)
conn.commit()

conn.close()

In [ ]:
import sqlite3

conn = sqlite3.connect('chinook.db')
cur = conn.cursor()


strSQL = " SELECT CustomerId  "
strSQL = strSQL + " FROM 	(SELECT  CustomerId, sum(Total) as GrandTotal FROM invoices GROUP BY CustomerId  ) "
strSQL = strSQL + " WHERE GrandTotal  > ( SELECT avg(GrandTotal)*0.5+max(GrandTotal)*0.5   "
strSQL = strSQL + " FROM (SELECT  CustomerId, sum(Total) as GrandTotal FROM invoices GROUP BY CustomerId) )  "

print(strSQL)

cur.execute(strSQL)
results = cur.fetchall()
print(results)

if len(results) < 1:
    print('Table is empty.')
    
else :
    for i in range(len(results)):
        CustId = results[i][0]
        #print(CustId)

        strSQL = " Update customers set vip_rank= 10 "
        strSQL = strSQL + " where customerid =  " + str(CustId) 

        cur.execute(strSQL)
    conn.commit()
    
conn.close()

### 위 코드 함수화

In [41]:
import sqlite3


def getPlatinumList(db_cursor):

    strSQL = " SELECT CustomerId  "
    strSQL = strSQL + " FROM 	(SELECT  CustomerId, sum(Total) as GrandTotal FROM invoices GROUP BY CustomerId  ) "
    strSQL = strSQL + " WHERE GrandTotal  > ( SELECT avg(GrandTotal)*0.5+max(GrandTotal)*0.5   "
    strSQL = strSQL + " FROM (SELECT  CustomerId, sum(Total) as GrandTotal FROM invoices GROUP BY CustomerId) )  "
    
    db_cursor.execute(strSQL)
    custList = db_cursor.fetchall()
    
    return custList

def setVIPRank(db_cursor, customer_list, customer_rank):
    
    numOfCustomers = len(customer_list)
    for i in range(numOfCustomers):
        CustId = customer_list[i][0]
        #print(CustId)

        strSQL = " Update customers set vip_rank =  " + str(customer_rank) 
        strSQL =  strSQL + " where customerid =  " + str(CustId) 
        print(strSQL)
        db_cursor.execute(strSQL)
        
def setVIPRank2(db_cursor, customer_list, customer_rank):
    
    numOfCustomers = len(customer_list)
    try:
        for i in range(numOfCustomers):
            CustId = customer_list[i][0]
            #print(CustId)

            strSQL = " Update customers set vip_rank =  " + str(customer_rank) 
            strSQL =  strSQL + " where customerid =  " + str(CustId) 
            print(strSQL)
            db_cursor.execute(strSQL)
            
        Is_OK =True
    except:
        Is_OK =False
        
    return Is_OK
    
#main function ---------------------------------------------------------------------------------------------------

conn = sqlite3.connect('chinook.db')
cur = conn.cursor()

#함수 호출 
custList = getPlatinumList(cur)

if len(custList) <1:
    print('No VIP')
else: 
    if setVIPRank2(cur, custList, 1000): #setVIPRank2가 True 이면 이란 의미 
        
        conn.commit()
        print('성공')
    else:
        conn.rollback()
        print('실패')
    
conn.close()

 Update customers set vip_rank =  1000 where customerid =  6
 Update customers set vip_rank =  1000 where customerid =  26
 Update customers set vip_rank =  1000 where customerid =  45
 Update customers set vip_rank =  1000 where customerid =  46
 Update customers set vip_rank =  1000 where customerid =  57
성공

### 타이타닉 
- 데이터 한번에 넣기 to_sql

In [55]:
import pandas as pd
import sqlite3

titanic_data = pd.read_csv("./titanic.csv" ) #상대경로 

conn = sqlite3.connect('chinook.db')
titanic_data.to_sql('titanic', conn)


conn.close()

TypeError: read_csv() got an unexpected keyword argument 'inplace'

In [47]:
import pandas as pd
import sqlite3

conn = sqlite3.connect('chinook.db')
cur = conn.cursor()

# Method 1
strSQL = "SELECT * FROM titanic"
cur.execute(strSQL)
titanic_list = cur.fetchall()
print(type(titanic_list))

# if len(titanic_list) < 1:
#     print('Table is empty.')
# else:
#     for result in titanic_list:
#         print(result)

# Method 2
strSQL = "SELECT * FROM titanic"
titanic_dataframe = pd.read_sql(strSQL, conn)
print(type(titanic_dataframe))

conn.close()

<class 'list'>
<class 'pandas.core.frame.DataFrame'>

In [54]:
titanic_dataframe.head()

,index,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,None,S
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,None,S
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,None,S

In [59]:
titanic_data.iloc[:3,  [2,5,7]]

   Pclass   Age  Parch
0       3  22.0      0
1       1  38.0      0
2       3  26.0      0

In [1]:
# %reset -f #모든 변수들을 지우고 시작

import pandas as pd 
import sqlite3

titanic_data = pd.read_csv("./titanic.csv" )
# titanic_data = pd.DataFrame(titanic_data)

print(titanic_data)
conn = sqlite3.connect('chinook.db')
cur = conn.cursor()

strSQL = "INSERT INTO titanic_selected"
strSQL = strSQL + "(PassengerId, Name) values ( "
strSQL = strSQL + str(titanic_data["PassengerId"][4]) + ", "
strSQL = strSQL +  "'" + str(titanic_data["Name"][4]) + "' ) "

print(strSQL)

try:
    cur.execute(strSQL)
    conn.commit()
    print('정상처리!')
except:
    print('error!')
    conn.rollback()
    
strSQL = "select * from titanic_selected "
cur.execute(strSQL)
results = cur.fetchall()

print(results)

conn.close()

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]
INSERT INTO titanic_selected(PassengerId, Name) values ( 5, 'Allen, Mr. William Henry' )
error!
[(1, None, None, 'Braund, Mr. Owen Harris', None, None), (2, None, None, 'Cumings, Mrs. John Bradley (Florence Briggs Thayer)', None, None), (3, None, None, 'Heikkinen, Miss. Laina', None, None), (4, None, None, 'Futrelle, Mrs. Jacques Heath (Lily May Peel)', None, None), (5, None, None, 'Allen, Mr. William Henry', None, None)]

### DELETE

In [71]:
import sqlite3

conn = sqlite3.connect('chinook.db')
cur = conn.cursor()

strSQL = "delete from titanic_selected"
cur.execute(strSQL)
conn.commit()

conn.close()

In [7]:
import sqlite3

conn = sqlite3.connect('chinook.db')
cur = conn.cursor()

strSQL = "select * from titanic_selected"
titanic_dataframe = pd.read_sql(strSQL, conn)

conn.close()

In [8]:
titanic_dataframe

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age]
Index: []

### 모든 ROW를 DB에 Import 하려면?
### 한번에한 개씩 INSERT 구문을 실행하기 
- 총 ROW 개수는?
- For Loop

In [10]:
len(titanic_data["PassengerId"])

891

In [12]:
titanic_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [13]:
titanic_data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [22]:


import pandas as pd 
import sqlite3

titanic_data = pd.read_csv("./titanic.csv" )
# titanic_data = pd.DataFrame(titanic_data)

print(titanic_data)
conn = sqlite3.connect('chinook.db')
cur = conn.cursor()


for i in range(5): #range(len(titanic_data["PassengerId"]))
    strSQL = "INSERT INTO titanic_selected"
    strSQL = strSQL + "(PassengerId, Survived, Pclass, Name, Sex, Age) values ( "
    strSQL = strSQL + str(titanic_data["PassengerId"][i]) + ", "
    strSQL = strSQL + str(titanic_data["Survived"][i]) + ", "
    strSQL = strSQL + str(titanic_data["Pclass"][i]) + ", "
    strSQL = strSQL + "'"  + str(titanic_data["Name"][i]) + "' , "
    strSQL = strSQL +  "'"  + str(titanic_data["Sex"][i]) + "' , "
    strSQL = strSQL + str(titanic_data["Age"][i]) + " ) "

#     print(strSQL)

    try:
        cur.execute(strSQL)
        conn.commit()
        print('PassengerId = ' + str(i) + ' 정상처리!')
    except:
        print('PassengerId = ' + str(i) + ' 오류!')
        conn.rollback()

        
#sqlite로 보는 방법
strSQL = "select * from titanic_selected "
# cur.execute(strSQL)
# results = cur.fetchall()
# print(results)

#판다스로 데이터 옮기기
titanic_dataframe = pd.read_sql(strSQL, conn)

conn.close()

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]
PassengerId = 0 정상처리!
PassengerId = 1 정상처리!
PassengerId = 2 정상처리!
PassengerId = 3 정상처리!
PassengerId = 4 정상처리!

In [20]:
titanic_dataframe

,PassengerId,Survived,Pclass,Name,Sex,Age
0,1,0,3,"Braund, Mr. Owen Harris",male,22
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38
2,3,1,3,"Heikkinen, Miss. Laina",female,26
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35
4,5,0,3,"Allen, Mr. William Henry",male,35

In [25]:
import pandas as pd
import sqlite3

file_name = './titanic.csv'
titanic_data = pd.read_csv(file_name)

rowNum = titanic_data["PassengerId"].count()
rowNum = 5

conn = sqlite3.connect('chinook.db')
cur = conn.cursor()

strSQL_all = ""

for i in range(rowNum):
    strSQL = "INSERT INTO titanic_selected "
    strSQL = strSQL + "( PassengerId, Name ) VALUES ( "
    strSQL = strSQL + str(titanic_data["PassengerId"][i]) + ", "
    strSQL = strSQL + "'" + titanic_data["Name"][i] + "' ); "
    strSQL = strSQL + "\n"
    
    strSQL_all = strSQL_all + strSQL
    
print(strSQL_all)

# try:
#     cur.executescript(strSQL_all)
#     conn.commit()
#     print('정상처리!')
# except:
#     conn.rollback()
#     print('오류!')
        

# 데이터 확인        
strSQL = "SELECT * FROM  titanic_selected "
# cur.execute(strSQL)
# results = cur.fetchall()
# print(results)

titanic_dataframe = pd.read_sql(strSQL, conn)

conn.close()

INSERT INTO titanic_selected ( PassengerId, Name ) VALUES ( 1, 'Braund, Mr. Owen Harris' );
INSERT INTO titanic_selected ( PassengerId, Name ) VALUES ( 2, 'Cumings, Mrs. John Bradley (Florence Briggs Thayer)' );
INSERT INTO titanic_selected ( PassengerId, Name ) VALUES ( 3, 'Heikkinen, Miss. Laina' );
INSERT INTO titanic_selected ( PassengerId, Name ) VALUES ( 4, 'Futrelle, Mrs. Jacques Heath (Lily May Peel)' );
INSERT INTO titanic_selected ( PassengerId, Name ) VALUES ( 5, 'Allen, Mr. William Henry' );

### (Method 3) executemany 구문을 이용

### 일단, 한 개의 Insert 구문을 실행시켜보자.

* (Style #1) question mark style
- str 혹은 int 타입 확인하고 "?"에 넣기

In [40]:
%reset -f

import pandas as pd
import sqlite3

file_name = './titanic.csv'
titanic_data = pd.read_csv(file_name)

conn = sqlite3.connect('chinook.db')
cur = conn.cursor()

# passID = titanic_data["PassengerId"][0] #int type error
passID = int(titanic_data["PassengerId"][10])
passName = titanic_data["Name"][10]

strSQL = "INSERT INTO titanic_selected ( PassengerId, Name ) VALUES (?, ?) "
print(strSQL)

cur.execute(strSQL, (passID, passName))
conn.commit()

strSQL = "SELECT * FROM  titanic_selected "
cur.execute(strSQL)
results = cur.fetchall()

print(results)
    
conn.close()

INSERT INTO titanic_selected ( PassengerId, Name ) VALUES (?, ?)
[(11, None, None, 'Sandstrom, Miss. Marguerite Rut', None, None)]

In [33]:
print(type(passID),type(passName))

<class 'numpy.int64'> <class 'str'>

### 일단, 한 개의 Insert 구문을 실행시켜보자.
(Style #2) the named style

In [43]:
import pandas as pd
import sqlite3

file_name = './titanic.csv'
titanic_data = pd.read_csv(file_name)

conn = sqlite3.connect('chinook.db')
cur = conn.cursor()

# passID = titanic_data["PassengerId"][0] #int type error
passID = int(titanic_data["PassengerId"][0])
passName = titanic_data["Name"][0]

strSQL = "INSERT INTO titanic_selected ( PassengerId, Name ) VALUES (:passID, :passName) "
print(strSQL)

cur.execute(strSQL, {"passID" :passID, "passName" :passName})
conn.commit()


strSQL = "SELECT * FROM titanic_selected"

INSERT INTO titanic_selected ( PassengerId, Name ) VALUES (:passID, :passName)

In [44]:
import pandas as pd
import sqlite3

file_name = './titanic.csv'
titanic_data = pd.read_csv(file_name)

conn = sqlite3.connect('chinook.db')
cur = conn.cursor()

for i in range(5,8):
    passID = int(titanic_data["PassengerId"][i])
    passName = titanic_data["Name"][i]

    strSQL = "INSERT INTO titanic_selected ( PassengerId, Name ) VALUES (:passID, :passName) "
    print(strSQL)

    cur.execute(strSQL, {"passID" :passID, "passName" :passName})
conn.commit()

INSERT INTO titanic_selected ( PassengerId, Name ) VALUES (:passID, :passName)
INSERT INTO titanic_selected ( PassengerId, Name ) VALUES (:passID, :passName)
INSERT INTO titanic_selected ( PassengerId, Name ) VALUES (:passID, :passName)

In [72]:
import pandas as pd
import sqlite3

file_name = './titanic.csv'
titanic_data = pd.read_csv(file_name)

conn = sqlite3.connect('chinook.db')
cur = conn.cursor()

rowNum = titanic_data["PassengerId"].count()
rowNum = 5

passData = []
for i in range(rowNum):
    passID = int(titanic_data["PassengerId"][i])
    passName = titanic_data["Name"][i]
    
    passData.append([passID, passName])

strSQL = "INSERT INTO titanic_selected ( PassengerId, Name ) "
strSQL = strSQL + " VALUES (:passID, :passName) "
print(strSQL)

cur.executemany(strSQL, passData)
conn.commit()

# 데이터 확인        
strSQL = "SELECT * FROM  titanic_selected "
# cur.execute(strSQL)
# results = cur.fetchall()
# print(results)

titanic_dataframe = pd.read_sql(strSQL, conn)
    
conn.close()

INSERT INTO titanic_selected ( PassengerId, Name )  VALUES (:passID, :passName)

In [66]:
len(titanic_data["PassengerId"])

891

In [75]:
passData

[[1, 'Braund, Mr. Owen Harris'],
 [2, 'Cumings, Mrs. John Bradley (Florence Briggs Thayer)'],
 [3, 'Heikkinen, Miss. Laina'],
 [4, 'Futrelle, Mrs. Jacques Heath (Lily May Peel)'],
 [5, 'Allen, Mr. William Henry']]